{"title": "Massachusetts Institute of Technology(MIT) hacked by ~SaHoo~", "article text": "MIT  Massachusetts Institute of Technology Site Subdomain has been hacked and defaced by an Indian hacker SaHoo. Yesterday, the same hacker was in news by How attacker managed to get access is unknown. The main site remains intact but attacker hacked the subdomain of the site. However, Hacker was not able to deface the full page.The message indicated that the hacker simple wanted to remind them about their security. The site dont appear to be storing any sensitive information of their student. However, such an attack can still impact an institutes image.The Hacker writes on the deface page:", "time": "2014-9-2"}{"title": "Pakistan Meteorological department website hacked by XerXes", "article text": "Official website and subdomains of pakistan Meteorological department is hacked by a hacker with the handle XerXes from Pak Cyber Crew.Web attack type is unknown. It seems that hacker exploited the vulnerability on the server and managed to deface the websites.The offical site with 8 others subdomains were hacked.http://pmd.gov.pk/pcc.htmThe hacked wrote a message on the deface to Prime minister pakistan to stop The killing of peacefull protesters. The hacker writes,More than 50 Government site hacked since last two weeks as a protest. The hackers also hacked state owned site PTV(Pakistan Television Site) and Interior ministry as a protest.At the time of writing, The website was defaced and showing the message left by the hacker.", "time": "2014-9-10"}{"title": "Pakistan Ministry of Interior(www.interior.gov.pk) Gets Hacked by Anonymous Hackers, Protests Fake Elections", "article text": "Today, Pakistan Ministry of Interior has been hacked and defaced by some unknown hackers on the Defence Day of Pakistan.The hacker mocked at the Interior Minister (Ch Nisar Ali Khan) and called him Patwari and protested against Elections Rigging. The hacker writes on the deface page:http://www.zone-h.org/mirror/id/22862098As protests continue on the roads in the capital city of Pakistan against Election rigging, the hackers also protests by hacking Interior ministry Website to raise awareness of rigging to the world. The hackers also At the time of writing, Interior Ministry Site was defaced and showing the message left by the hackers.", "time": "2014-9-6"}{"title": "Iranian Cyber Police Arrested 240 M/W Shut Down about 900 Websites", "article text": "Shahrwand newspaper reported that Iranian cyber police (known as FATA)arrested at-least 240+ people which include men and women and also shut down about 900 websites in Sistan and Baluchestan.According to reports all these people were involved in illegal internet activities includes managing porn and fake profiles,recently Cyber police of Revolutionary Guards announced its Spider project and arrested many social media and Facebook users for their immoral activities.Media watchdog", "time": "2015-3-15"}{"title": "Popular Hacking Forum Alboraaq Hacked by Eg-R1z", "article text": "Last month, Famous hacking forum It is unclear, how hackers managed to get into server. Either it was DNS attack on domain registrar of Alboraaq or It was type of actual web server attack.The possible reason of attack on the alboraaq server is scamming people on the alboraaq forum regarding private exploits.The hackers has also given warning that dont mess with Sec4ever members.", "time": "2014-9-25"}{"title": "Federal Health Insurance Website HealthCare.gov Hacked", "article text": "A hacker broke into a part of HealthCare.gov website (Federal Health Insurance Site) & succesfully uploaded malicious files during late July. Investigators found no evidence that consumers personal data was taken in the breach.According to The Department of Health and Human Services said in a statement. We have taken measures to further strengthen security.The attack on the site, where a potential risk of millions of individuals information is accessed, is the most recent in a string of high-profile data breaches.Community Health Systems, one of the primary hospital operators in the united states, is also dealing with a class-action lawsuit after having 4.5 million patient records accessed by sophisticated chinese hackers.Information of the HealthCare.gov breach emerged hours following President Barack Obama appointed former Google executive Megan Smith to be the next U.S. chief technology official.The recent data breaches of J.P. Morgan Chase & Co., Home Depot Inc., and ", "time": "2014-9-7"}{"title": "Stanford University website hacked by an Indian Hacker SaHoo", "article text": "Attack anatomy is unknown. The hacker successfully penetrated into the server and uploaded a defacement page on Stanford University website.The defacement looks kind of speculative as no specific reason mentioned by the hacker on the deface page. The hacker writes on the deface page:At the time of publishing the article, the website was still hacked and showing the deface page.", "time": "2014-8-31"}{"title": "Bangladesh Air Force Recruitment Site Hacked By Team Pak Cyber Experts & Pak Haxors Crew", "article text": "The website is not completely defaced. However, The hackers managed to upload the deface message on a news part of the website successfully.It is unclear whether hackers get access to some classified data or not, But its clear that hackers found and exploited SQL Injection flaw and uploaded the message on the website.The hackers has given warning to Bangladeshi Hackers to stop hacking Pakistani Sites. The deface message reads:", "time": "2014-9-10"}{"title": "iCloud Hacking using iBrute: Hacker leaks Nude Pictures of Several Celebrities", "article text": "An anonymous hacker has published several naked pictures of celebrities which is said to have obtained from their iCloud accounts. A total of 17 celebrities picture were posted on 4Chan during the weekend. The hacker also posted a list of all the celebrities of whom he has personal picture, 100 celebrities in total.Mary Winstead has tweeted that these pictures of her were deleted long ago.Actress Jennifer Lawrence has a small collection of her photos leaked. Ariana Grande whose pictures as well has been posted stated that these were fake. What remains unclear is, how did the hacker obtained all these pictures from the iCloud account? Is it mere password guessing, social engineering or by breaking into the system?At the time of publishing, administrators of 4Chan have blocked access to these threads as these victims are high profile personality. There will surely be strong investigation which will follow.", "time": "2014-9-2"}{"title": "Indian leading Marketplace Snapdeal Blog hacked by Pakistan Haxors Crew", "article text": "Anatomy of attack is unkonwn. As Snapdeals blog is developed with WordPress CMS, It seems that hacker exploited zero day flaw in one of the WordPress plugin and defaced the website.After exploiting the flaw, Hasnain Haxor succesfully managed to upload the deface page on the Snapdeal Server which raises questions on the Snapdeals server security.This is not the first time Hasnain haxor hacked Indian Site, before the hacker participated in According to the deface page, The Web attack on Snapdeal Server is executed as a payback of hacking Pakistani Sites by Indian Hackers.The hacker mocked at the security of the Snapdeal that claims 2 billion registered users. The hacker also left a reminder message on the page to fix the security of the website.At the time of writing, blog was taken down by Snapdeal administrators and blog was showing the maintenance message.", "time": "2014-10-13"}
